КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
    </type>
  </resources>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СвязиДокументов/КонтурЛогистика_СвязиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СвязиДокументов</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСвязейДокументов</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановкиВОчередь</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановкиСвязи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипДокументаОсновной</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДокументаПодчиненный</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОсновной</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектронныйЗаказНаряд</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПодчиненный</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяТранспортнаяНакладная</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ЭлектронныйЗаказНаряд</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыПодписи/КонтурЛогистика_СтатусыПодписи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыПодписи</name>
  <enumValues>
    <name>UnknownSenderSignatureStatus</name>
    <comment>значение зарезервировано для устаревших клиентов</comment>
  </enumValues>
  <enumValues>
    <name>WaitingForSenderSignature</name>
    <comment>ожидается подпись отправителя</comment>
  </enumValues>
  <enumValues>
    <name>SenderSignatureUnchecked</name>
    <comment>подпись отправителя еще не проверена</comment>
  </enumValues>
  <enumValues>
    <name>SenderSignatureCheckedAndValid</name>
    <comment>подпись отправителя проверена и валидна</comment>
  </enumValues>
  <enumValues>
    <name>SenderSignatureCheckedAndInvalid</name>
    <comment>подпись отправителя проверена и невалидна</comment>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыОшибокСтатусаТитула/КонтурЛогистика_ТипыОшибокСтатусаТитула.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыОшибокСтатусаТитула</name>
  <enumValues>
    <name>ОшибкаПодписи</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаМЧД</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаГИС</name>
  </enumValues>
  <enumValues>
    <name>ОбработанСПредупреждением</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаСервиса</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаСоединения</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСтатус(Документ, ЧерновикДляПустого = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик;
	КонецЕсли;
	
	СрезПоследних = СрезПоследних(, Новый Структура("Документ", Документ));
	Если СрезПоследних.Количество() > 0 Тогда
		Возврат СрезПоследних[0].Статус;
	КонецЕсли;
		
	Если ЧерновикДляПустого Тогда
		Возврат Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьПодробноеОписаниеОшибки(Документ) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПодробноеОписаниеОшибки", "");
	Результат.Вставить("КоличествоОшибок", 0);
	
	СрезПоследних = СрезПоследних(, Новый Структура("Документ", Документ));
	Если СрезПоследних.Количество() > 0 Тогда
		Результат.Вставить("ПодробноеОписаниеОшибки", СрезПоследних[0].ПодробноеОписаниеОшибки);
		Результат.Вставить("КоличествоОшибок", СрезПоследних[0].КоличествоОшибок);
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтатусРасширенный(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик;
	КонецЕсли;
	
	СрезПоследних = СрезПоследних(, Новый Структура("Документ", Документ));
	Если СрезПоследних.Количество() > 0 Тогда
		Возврат СрезПоследних[0];
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Устанавливает статус титула и фиксирует актуальный статус подписи.
//
// Параметры:
//  Документ - ДокументСсылка - титул логистики;
//  Статус - ПеречислениеСсылка.КонтурЛогистика_СтатусыТитулов - новый статус титула;
//  УказатьПользователя - Булево - записывать текущего пользователя 1С;
//  ПроверятьПоследовательностьСтатуса - Булево - запрет отката по цепочке статусов;
//  СтруктураОшибки - Структура, Неопределено - данные ошибки статуса;
//  СтатусПодписи - ПеречислениеСсылка.КонтурЛогистика_СтатусыПодписи, Неопределено -
//   явное значение статуса подписи; если Неопределено — берётся из крайнего файла обмена;
//  ПериодЗаписи - Дата, Неопределено - момент записи в регистре; если Неопределено — текущий момент МСК.
//
Процедура УстановитьСтатус(Документ, Статус, УказатьПользователя = Ложь, ПроверятьПоследовательностьСтатуса = Ложь,
	СтруктураОшибки = Неопределено, СтатусПодписи = Неопределено, ПериодЗаписи = Неопределено) Экспорт
	
	СрезПоследних = СрезПоследних( , Новый Структура("Документ", Документ));
	ЕстьСрез = СрезПоследних.Количество() > 0;
	
	Если СтатусПодписи = Неопределено Тогда
		СтатусПодписи = СтатусПодписиПоДокументу(Документ);
	КонецЕсли;
	
	ПредыдущийСтатусПодписи = ?(ЕстьСрез, СрезПоследних[0].СтатусПодписи,
		Перечисления.КонтурЛогистика_СтатусыПодписи.ПустаяСсылка());
	ИзменилсяСтатусПодписи = ПредыдущийСтатусПодписи <> СтатусПодписи;
	
	ИзмениласьОшибка = ЗначениеЗаполнено(СтруктураОшибки) И Не ТакаяОшибкаЕсть(Документ, СтруктураОшибки);
	ИзменилсяСтатус = Не ЕстьСрез Или СрезПоследних[0].Статус <> Статус;
	
	Если ИзменилсяСтатус Или ИзмениласьОшибка Или ИзменилсяСтатусПодписи Тогда
		
		Если ПроверятьПоследовательностьСтатуса = Истина
			И ЕстьСрез
			И НовыйСтатусПредыдущийВЦепочке(СрезПоследних[0].Статус, Статус) = Истина Тогда
			
			ВызватьИсключение "Попытка установить более старый статус в цепочке статусов";
			
		КонецЕсли;
		
		Если ИзменилсяСтатус
			И Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки
			И ДокументОбработан(Документ) Тогда
			Возврат;
		КонецЕсли;
		
		Запись = СоздатьМенеджерЗаписи();
		Запись.Документ = Документ;
		Если ЗначениеЗаполнено(ПериодЗаписи) Тогда
			Запись.Период = ПериодЗаписи;
		Иначе
			Запись.Период = КонтурЛогистика_ОбщегоНазначенияСервер.ТекущийМоментВремениМСК();
		КонецЕсли;
		Запись.Статус = Статус;
		Запись.СтатусПодписи = СтатусПодписи;
		
		Если ЗначениеЗаполнено(СтруктураОшибки) Тогда
			
			Запись.ТипОшибки = СтруктураОшибки.ТипОшибки;
			Запись.КодОшибки = СтруктураОшибки.КодОшибки;
			Запись.ОписаниеОшибки = СтруктураОшибки.ОписаниеОшибки;
			Запись.ПодробноеОписаниеОшибки = СтруктураОшибки.ПодробноеОписаниеОшибки;
			
			Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ОшибкаСервисаОтношенияНеУстановлены(СтруктураОшибки.ПодробноеОписаниеОшибки) Тогда
				ОбновитьПовторноИспользуемыеЗначения();
			КонецЕсли;
			
			Если СтруктураОшибки.Свойство("Количество") Тогда
				Запись.КоличествоОшибок = СтруктураОшибки.Количество;
			КонецЕсли;
			
			Если ЕстьСрез Тогда
				ПредПериод = СрезПоследних[0].Период;
				Если ЗначениеЗаполнено(ПредПериод) И Запись.Период <= ПредПериод Тогда
					Запись.Период = ПредПериод + 1;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли Не ИзменилсяСтатус И ЕстьСрез Тогда
			// Меняется только статус подписи — сохраняем сведения об ошибке из среза.
			Запись.ТипОшибки = СрезПоследних[0].ТипОшибки;
			Запись.КодОшибки = СрезПоследних[0].КодОшибки;
			Запись.ОписаниеОшибки = СрезПоследних[0].ОписаниеОшибки;
			Запись.ПодробноеОписаниеОшибки = СрезПоследних[0].ПодробноеОписаниеОшибки;
			Запись.КоличествоОшибок = СрезПоследних[0].КоличествоОшибок;
			Запись.Пользователь1С = СрезПоследних[0].Пользователь1С;
			
			ПредПериод = СрезПоследних[0].Период;
			Если ЗначениеЗаполнено(ПредПериод) И Запись.Период <= ПредПериод Тогда
				Запись.Период = ПредПериод + 1;
			КонецЕсли;
			
		КонецЕсли;
		
		Если УказатьПользователя = Истина Тогда
			
			Попытка
				
				Запись.Пользователь1С = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ПолучитьТекущегоПользователя1С();
				
			Исключение
				
				КонтурЛогистика_Метрика.ОбработатьОшибку("УстановитьСтатус", ОписаниеОшибки(),
					Документ, "не смогли определить тек пользователя 1С");
				
			КонецПопытки;
		КонецЕсли;
		
		Запись.Записать();
		
		// Если требуется, то документ добавится в очередь на поиск/создание связанного документа
		Если ЗначениеЗаполнено(Документ) Тогда
			РегистрыСведений.КонтурЛогистика_СвязиДокументов.ДобавитьВОчередь(Документ);
		КонецЕсли;
		
	КонецЕсли;
	
	// вызовем ПМ для кастомных завершающих действий с документом типовой конфишурации
	Если Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена
		ИЛИ Статус = Перечисления.КонтурЛогистика_СтатусыТитулов.Пропущен Тогда
		
		КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
			"ПослеЗавершенияРаботыСТитулом",
			Ложь,
			Новый Структура("Документ,Статус", Документ, Статус));
			
	КонецЕсли;
	
КонецПроцедуры

// Заполняет ресурс СтатусПодписи в срезе последних по данным крайних файлов обмена.
// Обрабатываются только записи среза с периодом не старше 60 дней от текущей даты.
// Используется обработчиком обновления данных подсистемы.
//
Процедура ЗаполнитьСтатусыПодписиВСрезеПоследних() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДатаСеанса() - 60 * 24 * 60 * 60));
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтатусыТитулов.Документ КАК Документ,
		|	МАКСИМУМ(СтатусыТитулов.Период) КАК Период
		|ПОМЕСТИТЬ врСрезПериоды
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СтатусыТитулов КАК СтатусыТитулов
		|ГДЕ
		|	СтатусыТитулов.Период >= &ДатаНачала
		|
		|СГРУППИРОВАТЬ ПО
		|	СтатусыТитулов.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	врСрезПериоды.Период КАК Период,
		|	врСрезПериоды.Документ КАК Документ,
		|	СтатусыТитулов.СтатусПодписи КАК СтатусПодписиСреза
		|ПОМЕСТИТЬ врСрез
		|ИЗ
		|	врСрезПериоды КАК врСрезПериоды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_СтатусыТитулов КАК СтатусыТитулов
		|		ПО врСрезПериоды.Документ = СтатусыТитулов.Документ
		|			И врСрезПериоды.Период = СтатусыТитулов.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФайлыОбмена.СвязанныйДокумент КАК Документ,
		|	МАКСИМУМ(ФайлыОбмена.Код) КАК Код
		|ПОМЕСТИТЬ врКрайниеКоды
		|ИЗ
		|	Справочник.КонтурЛогистика_ФайлыОбмена КАК ФайлыОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ врСрез КАК врСрез
		|		ПО ФайлыОбмена.СвязанныйДокумент = врСрез.Документ
		|ГДЕ
		|	НЕ ФайлыОбмена.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	ФайлыОбмена.СвязанныйДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	врСрез.Период КАК Период,
		|	врСрез.Документ КАК Документ,
		|	врСрез.СтатусПодписиСреза КАК СтатусПодписиСреза,
		|	ФайлыОбмена.СтатусПодписи КАК СтатусПодписиФайла,
		|	ФайлыОбмена.ПодписьВерна КАК ПодписьВерна
		|ИЗ
		|	врСрез КАК врСрез
		|		ЛЕВОЕ СОЕДИНЕНИЕ врКрайниеКоды КАК врКрайниеКоды
		|		ПО врСрез.Документ = врКрайниеКоды.Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ФайлыОбмена КАК ФайлыОбмена
		|		ПО врКрайниеКоды.Документ = ФайлыОбмена.СвязанныйДокумент
		|			И врКрайниеКоды.Код = ФайлыОбмена.Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовыйСтатусПодписи = СтатусПодписиИзДанныхФайла(Выборка.СтатусПодписиФайла, Выборка.ПодписьВерна);
		Если Выборка.СтатусПодписиСреза = НовыйСтатусПодписи Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = СоздатьМенеджерЗаписи();
		Запись.Период = Выборка.Период;
		Запись.Документ = Выборка.Документ;
		Запись.Прочитать();
		Если Не Запись.Выбран() Тогда
			Продолжить;
		КонецЕсли;
		
		Запись.СтатусПодписи = НовыйСтатусПодписи;
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЧерновикДляНовогоДокумента(ДокументСсылка) Экспорт

		// Статус Черновик для нового документа
	Если Не ДокументСсылка.ПометкаУдаления Тогда
		
		ТекСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументСсылка, Ложь);
		Если Не ЗначениеЗаполнено(ТекСтатус) Тогда 
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(ДокументСсылка, 
										Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик, Истина, Истина);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьСтатусыДокументам(МассивДокументов, НовыйСтатус, УказатьПользователя = Ложь, ПроверятьПоследовательностьСтатуса = Ложь) Экспорт
	
	Попытка
		
		Для Каждого Документ Из МассивДокументов Цикл
			
			УстановитьСтатус(Документ, НовыйСтатус, УказатьПользователя, ПроверятьПоследовательностьСтатуса);
			
		КонецЦикла;
		
	Исключение
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось изменить статус документа по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		
	КонецПопытки;
	
КонецПроцедуры 

Функция ТакаяОшибкаЕсть(Документ, СтруктураОшибки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_СтатусыТитулов.Документ КАК Документ,
		|	КонтурЛогистика_СтатусыТитулов.Статус КАК Статус,
		|	КонтурЛогистика_СтатусыТитулов.КодОшибки КАК КодОшибки
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СтатусыТитулов КАК КонтурЛогистика_СтатусыТитулов
		|ГДЕ
		|	КонтурЛогистика_СтатусыТитулов.Документ = &Документ
		|	И КонтурЛогистика_СтатусыТитулов.ТипОшибки = &ТипОшибки
		|	И КонтурЛогистика_СтатусыТитулов.Статус = &Статус
		|	И КонтурЛогистика_СтатусыТитулов.КодОшибки = &КодОшибки";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("КодОшибки", СтруктураОшибки.КодОшибки);
	Запрос.УстановитьПараметр("Статус", Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка);
	Запрос.УстановитьПараметр("ТипОшибки", СтруктураОшибки.ТипОшибки);
	    
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Пока РезультатЗапроса.Количество() > 0 Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ДокументОбработан(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_СтатусыТитулов.Документ КАК Документ,
		|	КонтурЛогистика_СтатусыТитулов.Статус КАК Статус,
		|	КонтурЛогистика_СтатусыТитулов.КодОшибки КАК КодОшибки
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_СтатусыТитулов КАК КонтурЛогистика_СтатусыТитулов
		|ГДЕ
		|	КонтурЛогистика_СтатусыТитулов.Документ = &Документ
		|	И КонтурЛогистика_СтатусыТитулов.Статус = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыТитулов.Получен)";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	    
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Пока РезультатЗапроса.Количество() > 0 Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ДоверятьМЧД(ОтпечатокСертификата, КомуВыданСертификат, МЧД, ОшибкиМЧД) Экспорт
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
	
		КонтурЛогистика_МашиночитаемыеДовернностиСервер.ДобавитьДоверенныеСертификаты(МЧД, ОтпечатокСертификата, КомуВыданСертификат, ОшибкиМЧД);
		
		УдалитьОшибкиМЧД(ОтпечатокСертификата, МЧД, ОшибкиМЧД);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ТекстОшибки = "Доверять МЧД
			|Текст ошибки: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение.Сообщить();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Изменения не зафиксированы";
		Сообщение.Сообщить();
				
	КонецПопытки;
			
КонецПроцедуры

Процедура УдалитьОшибкиМЧД(ОтпечатокСертификата, МЧД, ОшибкиМЧД) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Игнорируем ошибки МЧД";
	Сообщение.Сообщить();
	
	КодОшибкиПолномочияМЧД = КонтурЛогистика_МашиночитаемыеДоверенностиКлиентСервер.КодОшибкиСтатусаПолномочияМЧД();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_ФайлыОбмена.СвязанныйДокумент КАК СвязанныйДокумент,
		|	КонтурЛогистика_СтатусыТитулов.Период КАК Период,
		|	КонтурЛогистика_СтатусыТитулов.Статус КАК Статус
		|ИЗ
		|	Справочник.КонтурЛогистика_ФайлыОбмена КАК КонтурЛогистика_ФайлыОбмена
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_СтатусыТитулов КАК КонтурЛогистика_СтатусыТитулов
		|		ПО КонтурЛогистика_ФайлыОбмена.СвязанныйДокумент = КонтурЛогистика_СтатусыТитулов.Документ
		|ГДЕ
		|	КонтурЛогистика_ФайлыОбмена.ИдентификаторМЧД = &ИдентификаторМЧД
		|	И КонтурЛогистика_ФайлыОбмена.Отпечаток = &Отпечаток";
	
	Если ОшибкиМЧД = КонтурЛогистика_МашиночитаемыеДоверенностиКлиентСервер.КодОшибкиСтатусаПолномочияМЧД() Тогда
		Запрос.Текст = Запрос.Текст +
			"	И КонтурЛогистика_СтатусыТитулов.КодОшибки = &КодОшибкиПолномочияМЧД";
		
	Иначе
		Запрос.Текст = Запрос.Текст +
			"	И КонтурЛогистика_ФайлыОбмена.ОшибкиПроверкиМЧД ПОДОБНО ""%"" + &ОшибкиПроверкиМЧД + ""%""
			|	И КонтурЛогистика_СтатусыТитулов.КодОшибки <> &КодОшибкиПолномочияМЧД";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст +
		"	И КонтурЛогистика_СтатусыТитулов.ТипОшибки = ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыОшибокСтатусаТитула.ОшибкаМЧД)
		|	И КонтурЛогистика_СтатусыТитулов.Период > НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -7), ДЕНЬ)
		|ИТОГИ ПО
		|	СвязанныйДокумент";
	
	Запрос.УстановитьПараметр("ИдентификаторМЧД", МЧД.ИдентификаторДоверенности);
	Запрос.УстановитьПараметр("Отпечаток", ОтпечатокСертификата);
	Запрос.УстановитьПараметр("ОшибкиПроверкиМЧД", ОшибкиМЧД);
	Запрос.УстановитьПараметр("КодОшибкиПолномочияМЧД", КодОшибкиПолномочияМЧД);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокумент.Следующий() Цикл		
			
		ЕстьОшибки = Ложь;
		
		Если КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулТрн(ВыборкаДокумент.СвязанныйДокумент) 
				ИЛИ КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулПЛ(ВыборкаДокумент.СвязанныйДокумент)
				ИЛИ КонтурЛогистика_ОбработкаДокументовСервер.ЭтоТитулЗЗ(ВыборкаДокумент.СвязанныйДокумент) Тогда
				
			ВыборкаДетальныеЗаписи = ВыборкаДокумент.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
					
					Запись = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.СоздатьМенеджерЗаписи();
					Запись.Период = ВыборкаДетальныеЗаписи.Период;
					Запись.Документ = ВыборкаДетальныеЗаписи.СвязанныйДокумент;
					Запись.Удалить();
					
					ЕстьОшибки = Истина;			
								
			КонецЦикла;
				
		КонецЕсли;
		
		Если ЕстьОшибки Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = Строка(ВыборкаДокумент.СвязанныйДокумент);
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЦикла;
		
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Игнорирование ошибок МЧД завершено";
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Возвращает статус подписи по крайнему файлу обмена документа.
// Нет файла — пустая ссылка перечисления.
//
Функция СтатусПодписиПоДокументу(Документ)
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат Перечисления.КонтурЛогистика_СтатусыПодписи.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтурЛогистика_ФайлыОбмена.СтатусПодписи КАК СтатусПодписи,
		|	КонтурЛогистика_ФайлыОбмена.ПодписьВерна КАК ПодписьВерна
		|ИЗ
		|	Справочник.КонтурЛогистика_ФайлыОбмена КАК КонтурЛогистика_ФайлыОбмена
		|ГДЕ
		|	НЕ КонтурЛогистика_ФайлыОбмена.ПометкаУдаления
		|	И КонтурЛогистика_ФайлыОбмена.СвязанныйДокумент = &СвязанныйДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	КонтурЛогистика_ФайлыОбмена.Код УБЫВ";
	Запрос.УстановитьПараметр("СвязанныйДокумент", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Перечисления.КонтурЛогистика_СтатусыПодписи.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СтатусПодписиИзДанныхФайла(Выборка.СтатусПодписи, Выборка.ПодписьВерна);
	
КонецФункции

// Вычисляет статус подписи по реквизитам файла обмена.
// При пустом СтатусПодписи и ПодписьВерна = Истина — fallback на SenderSignatureCheckedAndValid.
//
Функция СтатусПодписиИзДанныхФайла(СтатусПодписиФайла, ПодписьВерна)
	
	Если ЗначениеЗаполнено(СтатусПодписиФайла) Тогда
		Возврат СтатусПодписиФайла;
	КонецЕсли;
	
	Если ПодписьВерна = Истина Тогда
		Возврат Перечисления.КонтурЛогистика_СтатусыПодписи.SenderSignatureCheckedAndValid;
	КонецЕсли;
	
	Возврат Перечисления.КонтурЛогистика_СтатусыПодписи.ПустаяСсылка();
	
КонецФункции

// возвращает признак верной очередности нового статуса в соотв. с ожидаемым порядком в графе статусов
Функция НовыйСтатусПредыдущийВЦепочке(ТекСтатус, НовыйСтатус)
	
	НовыйСтатусПозднееВЦепочке = Истина; // дефолтно - все плохо
	
	// статусы РаботаЗавершенаРаспечатан и РаботаЗавершена и РаботаЗавершенаОтказВПодписи равнозначны,
	// поэтому можем переходить из одного статуса в другой
	МассивСтатусовЗавершен = Новый Массив;
	МассивСтатусовЗавершен.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан);
	МассивСтатусовЗавершен.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаОтказВПодписи);
	МассивСтатусовЗавершен.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена);
	
	Если Не МассивСтатусовЗавершен.Найти(ТекСтатус) = Неопределено 
		И Не МассивСтатусовЗавершен.Найти(НовыйСтатус) = Неопределено Тогда  
		Возврат Не НовыйСтатусПозднееВЦепочке;
	КонецЕсли;	
	
	МассивМодельПоследовательностиСтатусов = Новый Массив;
	
	// костыль: возможно отправлять подписанный после того как ранее был отрпавлен неподписанный
	Если НовыйСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке
		И (ТекСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
			ИЛИ ТекСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан
			// костыль2: возможно подписывать сформированный, если при подписании была ошибка
			ИЛИ ТекСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена) 
			Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтатус) И ЗначениеЗаполнено(НовыйСтатус) Тогда
	
		// ожидаемая модель цепочки состояний Документа	(последовательность Элементов в массиве)
		МассивМодельПоследовательностиСтатусов.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик);
		МассивМодельПоследовательностиСтатусов.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке);

		МассивМодельПоследовательностиСтатусов.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена);
		МассивМодельПоследовательностиСтатусов.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.Подписан);
						
		МассивМодельПоследовательностиСтатусов.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан);
		МассивМодельПоследовательностиСтатусов.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаОтказВПодписи);
		МассивМодельПоследовательностиСтатусов.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена);
			
		МассивМодельПоследовательностиСтатусов.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.Пропущен); // Пропускать можно из любого статуса
		МассивМодельПоследовательностиСтатусов.Добавить(Перечисления.КонтурЛогистика_СтатусыТитулов.Удален); // Удалять можно из любого статуса
		
		// ошибка - нет в таблице, номер 0
		
		НомерНовогоСтатуса = МассивМодельПоследовательностиСтатусов.Найти(НовыйСтатус);
		Если НомерНовогоСтатуса = Неопределено Тогда
			НомерНовогоСтатуса = 0;
		КонецЕсли;
		
		НомерТекущегоСтатуса = МассивМодельПоследовательностиСтатусов.Найти(ТекСтатус);
		Если НомерТекущегоСтатуса = Неопределено Тогда
			НомерТекущегоСтатуса = 0;
		КонецЕсли;
		
		Если НомерНовогоСтатуса > 0 И НомерНовогоСтатуса < НомерТекущегоСтатуса Тогда
			НовыйСтатусПозднееВЦепочке = Ложь; // устанавливаемый статус не ожидается в цепочке
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НЕ НовыйСтатусПозднееВЦепочке;

КонецФункции

#КонецОбласти

#КонецЕсли
